# Вычислить число Пи c заданной точностью d

import math
d = int(input('Введите точность d = '))
print(round(math.pi , d))